tap "hashicorp/tap"
tap "homebrew/bundle"
tap "pkgxdev/made"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Feature-rich console based todo list manager
brew "task"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terraform
brew "hashicorp/tap/terraform"
# Run Anything
brew "pkgxdev/made/pkgx"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Web browser focusing on privacy
cask "brave-browser"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Web browser
cask "firefox"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Speech recognition tool
cask "macwhisper"
# Calendar for professionals and teams
cask "notion-calendar"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# To-do list
cask "todoist"
